driver-tests/bpelse/samples/SampleProjectsMultiDepJBI/test/results/AsynchronousSample/Actual_20130326132845_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <typeA xmlns="http://www.mycomp.org/AsynchronousSampleSchemaNamespace" xmlns:asy="http://www.mycomp.org/AsynchronousSampleSchemaNamespace" xmlns:msgns="http://www.mycomp.org/AsynchronousSampleClient" xmlns:ns0="http://www.mycomp.org/AsynchronousSample" xmlns:ns1="http://www.mycomp.org/AsynchronousSample" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
      <paramA xmlns="">Hello Asynchronous World</paramA>
      <id xmlns="">18</id>
    </typeA>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>