driver-tests/bpelse/samples/SampleProjectsMultiDepJBI/test/AsynchronousSample/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:asy="http://www.mycomp.org/AsynchronousSampleSchemaNamespace">
  <soapenv:Body>
    <asy:typeA>
      <paramA>Hello Asynchronous World</paramA>
      <id>18</id>
    </asy:typeA>
  </soapenv:Body>
</soapenv:Envelope>